       IDENTIFICATION DIVISION.
       PROGRAM-ID. INTERESTCALC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BALANCE        PIC 9(7)V99.
       01 RATE           PIC 9V9999.
       01 DAYS           PIC 9(3).
       01 INTEREST       PIC 9(7)V99.
       01 NEW-BALANCE    PIC 9(7)V99.

       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "ENTER BALANCE "
           ACCEPT BALANCE.

           DISPLAY "ENTER ANNUAL INTEREST RATE. "
           ACCEPT RATE.

           DISPLAY "ENTER NUMBER OF DAYS. "
           ACCEPT DAYS.

           COMPUTE INTEREST = BALANCE * RATE * (DAYS / 365)
           COMPUTE NEW-BALANCE = BALANCE + INTEREST

           DISPLAY "INTEREST " INTEREST
           DISPLAY "NEW BALANCE " NEW-BALANCE

           STOP RUN.
