000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COMPOUNDINT.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 PRINCIPAL        PIC 9(7)V99.
000600 01 RATE             PIC 9V9999.
000700 01 YEARS            PIC 9(3).
000800 01 PERIODS          PIC 9(3).
000900 01 TEMP             PIC 9(9)V9999.
001000 01 FACTOR           PIC 9(9)V9999.
001100 01 FINAL-AMOUNT     PIC 9(9)V99.
001200 01 COUNTER          PIC 9(5).
001300 PROCEDURE DIVISION.
001400 MAIN-PARA.
001500     DISPLAY "ENTER PRINCIPAL ".
001600     ACCEPT PRINCIPAL.
001700     DISPLAY "ENTER ANNUAL INTEREST RATE (EXAMPLE 0.05 5%) ".
001800     ACCEPT RATE.
001900     DISPLAY "NUMBER OF YEARS ".
002000     ACCEPT YEARS.
002100     DISPLAY "ENTER COMPOUNDING PERIODS PER YEAR ".
002200     ACCEPT PERIODS.
002300     COMPUTE TEMP = RATE / PERIODS.
002400     COMPUTE FACTOR = 1 + TEMP.
002500     COMPUTE TEMP = PERIODS * YEARS.
002600     MOVE 1 TO FINAL-AMOUNT.
002700     MOVE 1 TO COUNTER.
002800     PERFORM UNTIL COUNTER > TEMP
002900         COMPUTE FINAL-AMOUNT = FINAL-AMOUNT * FACTOR
003000         ADD 1 TO COUNTER
003100     END-PERFORM.
003200     COMPUTE FINAL-AMOUNT = FINAL-AMOUNT * PRINCIPAL.
003300     DISPLAY "FINAL AMOUNT WITH COMPOUND INTEREST " FINAL-AMOUNT.
003400     STOP RUN.


        

